ERP.belugaerp/src/InformationRegisters/бг_ДокументыИнтеграцииСоСкладскимиСистемами/бг_ДокументыИнтеграцииСоСкладскимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДокументыИнтеграцииСоСкладскимиСистемами</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыДокументовИнтеграцииСоСкладскимиСистемами</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.битОтражениеФактаПоПриходномуОрдеру</types>
      <types>DocumentRef.битПереупаковка</types>
      <types>DocumentRef.битИнвентаризацияПродукцииЕГАИС</types>
      <types>DocumentRef.битОтражениеФактаПоРасходномуОрдеру</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ДокументыИнтеграцииСоСкладскимиСистемами/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбновитьСтатусДокумента(Документ, Дата, Статус, ВремяОбработки = 0, ТекстОшибки = "") Экспорт

	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.бг_ДокументыИнтеграцииСоСкладскимиСистемами.СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.Дата = Дата;
	Запись.Статус = Статус;
	Запись.ВремяОбработки = ВремяОбработки;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.Записать();

КонецПроцедуры

Функция ТекущийСтатус(Документ) Экспорт

	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ДокументыИнтеграцииСоСкладскимиСистемами.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бг_ДокументыИнтеграцииСоСкладскимиСистемами КАК бг_ДокументыИнтеграцииСоСкладскимиСистемами
	|ГДЕ
	|	бг_ДокументыИнтеграцииСоСкладскимиСистемами.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Статус;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
